package ru.otus.java.basic.homeworks;

public class Main {
    public static void main(String[] args) {


        /** Реализуйте приложение, позволяющее работать с текстовыми файлами:
        1) При старте приложения, в консоль выводится список текстовых файлов из корневого каталоге проекта
        2) Далее программа запрашивает имя файла, с которым хочет работать пользователь
        3) Содержимое файла выводится в консоль
        4) Затем любую введенную пользователем строку необходимо записывать в указанный файл */






    }
}
